type: Microsoft.SecurityInsights/alertRules
kind: Scheduled
asurgent_id: 170e1b1a-c49a-461b-a6fa-23060bddc540
properties:
  displayName: Possible ransomware stage attack has been detected to Inhibit System Recovery
  description: |
    Adversaries may delete or remove built-in operating system data and turn off services designed to aid in the recovery of a corrupted system to prevent recovery.
    Operating systems may contain features that can help fix corrupted systems, such as a backup catalog, volume shadow copies, and automatic repair features. 
    Adversaries may disable or delete system recovery features to augment the effects of Data Destruction and Data Encrypted for Impact.
    This might indicate a stage in a ransomware attack.

    This rule is part of Asurgent CloudOps Security, https://asurgent.com
  tactics:
  - Impact
  techniques:
  - T1490
  severity: High
  alertDetailsOverride:
    alertDisplayNameFormat:
    alertDescriptionFormat:
    alertTacticsColumnName:
    alertSeverityColumnName:
  enabled: true
  requiredDataConnectors:
  - connectorId: MicrosoftThreatProtection
    dataTypes:
    -  DeviceProcessEvents
  - connectorId: SecurityEvents
    dataTypes:
    - SecurityEvent
  query: |
    let lookback = 30m;
    (union isfuzzy=true
        (SecurityEvent
        | where TimeGenerated >= ago(lookback)
        | where EventID == 4688
        | extend
            FileName = tostring(split(NewProcessName, @'')[(-1)]),
            ProcessCommandLine = CommandLine,
            InitiatingProcessFileName = ParentProcessName,
            ProcessIdCustomEntity = toint(NewProcessId)
        | where FileName has_any (@"vssadmin.exe", @"wbadmin.exe", @"wmic.exe", @"bcdedit.exe") and 
                (
                    ProcessCommandLine has_all ("bcdedit", "/set", "{default}", "recoveryenabled no") or
                    ProcessCommandLine has_all ("bcdedit", "/set", "{default}", "bootstatuspolicy", "ignoreallfailures") or
                    ProcessCommandLine has_all ("delete", "shadows") or
                    ProcessCommandLine has_all ("wmic", "shadowcopy", "delete") or
                    ProcessCommandLine has_all ("delete", "catalog", "-quiet")
                )
        | project
            TimeGenerated,
            HostCustomEntity = Computer,
            AccountCustomEntity = Account,
            AccountDomain,
            ProcessName,
            ProcessNameFullPath = NewProcessName,
            EventID,
            Activity,
            FileName,
            ProcessCommandLine,
            ProcessIdCustomEntity,
            EventSourceName,
            Type
        ),
        (DeviceProcessEvents 
        | where TimeGenerated >= ago(lookback)
        | where
                FileName has_any (@"vssadmin.exe", @"wbadmin.exe", @"wmic.exe", @"bcdedit.exe") and
                (
                    ProcessCommandLine has_all ("bcdedit", "/set", "{default}", "recoveryenabled no") or
                    ProcessCommandLine has_all ("bcdedit", "/set", "{default}", "bootstatuspolicy", "ignoreallfailures") or
                    ProcessCommandLine has_all ("delete", "shadows") or
                    ProcessCommandLine has_all ("wmic", "shadowcopy", "delete") or
                    ProcessCommandLine has_all ("delete", "catalog", "-quiet")
                )
        | extend 
            elevatedExecution = iff(ProcessTokenElevation == "TokenElevationTypeFull", true, false),
            AccountCustomEntity = AccountUpn,
            HostCustomEntity = DeviceName,
            ProcessIdCustomEntity = toint(ProcessId)
        )
    )
  entityMappings:
    - fieldMappings:
      - identifier: FullName
        columnName: AccountCustomEntity
      entityType: Account
    - fieldMappings:
      - identifier: FullName
        columnName: HostCustomEntity
      entityType: Host
    - fieldMappings:
      - identifier: CommandLine
        columnName: ProcessCommandLine
      - identifier: ProcessId
        columnName: ProcessIdCustomEntity
      entityType: Process
  customDetails: {}
  queryFrequency: PT30M
  queryPeriod: PT30M
  triggerOperator: GreaterThan
  triggerThreshold: 0
  eventGroupingSettings:
    aggregationKind: SingleAlert
  suppressionEnabled: false
  suppressionDuration: PT1H
  incidentConfiguration:
    createIncident: true
    groupingConfiguration:
      enabled: true
      lookbackDuration: PT1H
      groupByEntities:
      - Host
      groupByAlertDetails: []
      matchingMethod: Selected
      groupByCustomDetails: []
      reopenClosedIncident: true
  tags:
  - Asurgent CloudOps Security
  - Ransomware
